; domain
(define (domain logistics-simple)
                  (:requirements :strips :typing)
                  (:types location vehicle package)
                  (:predicates
                    (at-vehicle ?v - vehicle ?l - location)
                    (at-package ?p - package ?l - location)
                    (in-vehicle ?p - package ?v - vehicle)
                    (connected ?from ?to - location)
                  )
                
                  (:action move
                   :parameters (?v - vehicle ?from ?to - location)
                   :precondition (and (at-vehicle ?v ?from) (connected ?from ?to))
                   :effect (and (not (at-vehicle ?v ?from)) (at-vehicle ?v ?to))
                  )
                
                  (:action load
                   :parameters (?p - package ?v - vehicle ?l - location)
                   :precondition (and (at-package ?p ?l) (at-vehicle ?v ?l))
                   :effect (and (not (at-package ?p ?l)) (in-vehicle ?p ?v))
                  )
                
                  (:action unload
                   :parameters (?p - package ?v - vehicle ?l - location)
                   :precondition (and (in-vehicle ?p ?v) (at-vehicle ?v ?l))
                   :effect (and (not (in-vehicle ?p ?v)) (at-package ?p ?l))
                  )
                )

; problem
(define (problem delivery-medium)
                  (:domain logistics-simple)
                  (:objects
                    warehouse depot shop home - location
                    truck - vehicle
                    package1 package2 - package
                  )
                  (:init
                    (at-vehicle truck warehouse)
                    (at-package package1 warehouse)
                    (at-package package2 depot)
                
                    (connected warehouse depot)
                    (connected depot warehouse)
                    (connected depot shop)
                    (connected shop depot)
                    (connected shop home)
                    (connected home shop)
                  )
                  (:goal
                    (and
                      (at-package package1 home)
                      (at-package package2 shop)
                    )
                  )
                )

; plan
1. (load package1 truck warehouse)
   deleted: (at-package package1 warehouse)
   added: (in-vehicle package1 truck)
   goals met: 0 of 2
2. (move truck warehouse depot)
   deleted: (at-vehicle truck warehouse)
   added: (at-vehicle truck depot)
   goals met: 0 of 2
3. (load package2 truck depot)
   deleted: (at-package package2 depot)
   added: (in-vehicle package2 truck)
   goals met: 0 of 2
4. (move truck depot shop)
   deleted: (at-vehicle truck depot)
   added: (at-vehicle truck shop)
   goals met: 0 of 2
5. (unload package2 truck shop)
   deleted: (in-vehicle package2 truck)
   added: (at-package package2 shop)
   goals met: 1 of 2
6. (move truck shop home)
   deleted: (at-vehicle truck shop)
   added: (at-vehicle truck home)
   goals met: 1 of 2
7. (unload package1 truck home)
   deleted: (in-vehicle package1 truck)
   added: (at-package package1 home)
   goals met: 2 of 2
